STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231dxx_ca35.h
/******************  Bit definition for FMC_SEMCR0 register  ******************/
#define FMC_SEMCR0_SEM_MUTEX_Pos      (0U)
#define FMC_SEMCR0_SEM_MUTEX_Msk      (0x1UL << FMC_SEMCR0_SEM_MUTEX_Pos)     /*!< 0x00000001 */
#define FMC_SEMCR0_SEM_MUTEX          FMC_SEMCR0_SEM_MUTEX_Msk               /*!< Mutex for the CID allocation of Resource x in semaphore mode */
#define FMC_SEMCR0_SEMCID_Pos         (4U)
#define FMC_SEMCR0_SEMCID_Msk         (0x7UL << FMC_SEMCR0_SEMCID_Pos)        /*!< 0x00000070 */
#define FMC_SEMCR0_SEMCID             FMC_SEMCR0_SEMCID_Msk                  /*!< Current CID allocated to resource x in semaphore mode */

/*****************  Bit definition for FMC_CIDCFGR1 register  *****************/
#define FMC_CIDCFGR1_CFEN_Pos         (0U)
#define FMC_CIDCFGR1_CFEN_Msk         (0x1UL << FMC_CIDCFGR1_CFEN_Pos)        /*!< 0x00000001 */
#define FMC_CIDCFGR1_CFEN             FMC_CIDCFGR1_CFEN_Msk                  /*!< CID filtering enable for resource x */
#define FMC_CIDCFGR1_SEMEN_Pos        (1U)
#define FMC_CIDCFGR1_SEMEN_Msk        (0x1UL << FMC_CIDCFGR1_SEMEN_Pos)       /*!< 0x00000002 */
#define FMC_CIDCFGR1_SEMEN            FMC_CIDCFGR1_SEMEN_Msk                 /*!< Semaphore enable for resource x */
#define FMC_CIDCFGR1_SCID_Pos         (4U)
#define FMC_CIDCFGR1_SCID_Msk         (0x7UL << FMC_CIDCFGR1_SCID_Pos)        /*!< 0x00000070 */
#define FMC_CIDCFGR1_SCID             FMC_CIDCFGR1_SCID_Msk                  /*!< Static CID for resource x */
#define FMC_CIDCFGR1_SEMWLC0_Pos      (16U)
#define FMC_CIDCFGR1_SEMWLC0_Msk      (0x1UL << FMC_CIDCFGR1_SEMWLC0_Pos)     /*!< 0x00010000 */
#define FMC_CIDCFGR1_SEMWLC0          FMC_CIDCFGR1_SEMWLC0_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR1_SEMWLC1_Pos      (17U)
#define FMC_CIDCFGR1_SEMWLC1_Msk      (0x1UL << FMC_CIDCFGR1_SEMWLC1_Pos)     /*!< 0x00020000 */
#define FMC_CIDCFGR1_SEMWLC1          FMC_CIDCFGR1_SEMWLC1_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR1_SEMWLC2_Pos      (18U)
#define FMC_CIDCFGR1_SEMWLC2_Msk      (0x1UL << FMC_CIDCFGR1_SEMWLC2_Pos)     /*!< 0x00040000 */
#define FMC_CIDCFGR1_SEMWLC2          FMC_CIDCFGR1_SEMWLC2_Msk               /*!< white-listed CID in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR1_SEMWLC3_Pos      (19U)
#define FMC_CIDCFGR1_SEMWLC3_Msk      (0x1UL << FMC_CIDCFGR1_SEMWLC3_Pos)     /*!< 0x00080000 */
#define FMC_CIDCFGR1_SEMWLC3          FMC_CIDCFGR1_SEMWLC3_Msk               /*!< white-listed CID in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR1_SEMWLC4_Pos      (20U)
#define FMC_CIDCFGR1_SEMWLC4_Msk      (0x1UL << FMC_CIDCFGR1_SEMWLC4_Pos)     /*!< 0x00100000 */
#define FMC_CIDCFGR1_SEMWLC4          FMC_CIDCFGR1_SEMWLC4_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR1_SEMWLC5_Pos      (21U)
#define FMC_CIDCFGR1_SEMWLC5_Msk      (0x1UL << FMC_CIDCFGR1_SEMWLC5_Pos)     /*!< 0x00200000 */
#define FMC_CIDCFGR1_SEMWLC5          FMC_CIDCFGR1_SEMWLC5_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR1_SEMWLC6_Pos      (22U)
#define FMC_CIDCFGR1_SEMWLC6_Msk      (0x1UL << FMC_CIDCFGR1_SEMWLC6_Pos)     /*!< 0x00400000 */
#define FMC_CIDCFGR1_SEMWLC6          FMC_CIDCFGR1_SEMWLC6_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR1_SEMWLC7_Pos      (23U)
#define FMC_CIDCFGR1_SEMWLC7_Msk      (0x1UL << FMC_CIDCFGR1_SEMWLC7_Pos)     /*!< 0x00800000 */
#define FMC_CIDCFGR1_SEMWLC7          FMC_CIDCFGR1_SEMWLC7_Msk               /*!< White-listed CID0 in the CID allocation pool of resource x in semaphore mode */

/******************  Bit definition for FMC_SEMCR1 register  ******************/
#define FMC_SEMCR1_SEM_MUTEX_Pos      (0U)
#define FMC_SEMCR1_SEM_MUTEX_Msk      (0x1UL << FMC_SEMCR1_SEM_MUTEX_Pos)     /*!< 0x00000001 */
#define FMC_SEMCR1_SEM_MUTEX          FMC_SEMCR1_SEM_MUTEX_Msk               /*!< Mutex for the CID allocation of Resource x in semaphore mode */
#define FMC_SEMCR1_SEMCID_Pos         (4U)
#define FMC_SEMCR1_SEMCID_Msk         (0x7UL << FMC_SEMCR1_SEMCID_Pos)        /*!< 0x00000070 */
#define FMC_SEMCR1_SEMCID             FMC_SEMCR1_SEMCID_Msk                  /*!< Current CID allocated to resource x in semaphore mode */

/*****************  Bit definition for FMC_CIDCFGR2 register  *****************/
#define FMC_CIDCFGR2_CFEN_Pos         (0U)
#define FMC_CIDCFGR2_CFEN_Msk         (0x1UL << FMC_CIDCFGR2_CFEN_Pos)        /*!< 0x00000001 */
#define FMC_CIDCFGR2_CFEN             FMC_CIDCFGR2_CFEN_Msk                  /*!< CID filtering enable for resource x */
#define FMC_CIDCFGR2_SEMEN_Pos        (1U)
#define FMC_CIDCFGR2_SEMEN_Msk        (0x1UL << FMC_CIDCFGR2_SEMEN_Pos)       /*!< 0x00000002 */
#define FMC_CIDCFGR2_SEMEN            FMC_CIDCFGR2_SEMEN_Msk                 /*!< Semaphore enable for resource x */
#define FMC_CIDCFGR2_SCID_Pos         (4U)
#define FMC_CIDCFGR2_SCID_Msk         (0x7UL << FMC_CIDCFGR2_SCID_Pos)        /*!< 0x00000070 */
#define FMC_CIDCFGR2_SCID             FMC_CIDCFGR2_SCID_Msk                  /*!< Static CID for resource x */
#define FMC_CIDCFGR2_SEMWLC0_Pos      (16U)
#define FMC_CIDCFGR2_SEMWLC0_Msk      (0x1UL << FMC_CIDCFGR2_SEMWLC0_Pos)     /*!< 0x00010000 */
#define FMC_CIDCFGR2_SEMWLC0          FMC_CIDCFGR2_SEMWLC0_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR2_SEMWLC1_Pos      (17U)
#define FMC_CIDCFGR2_SEMWLC1_Msk      (0x1UL << FMC_CIDCFGR2_SEMWLC1_Pos)     /*!< 0x00020000 */
#define FMC_CIDCFGR2_SEMWLC1          FMC_CIDCFGR2_SEMWLC1_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR2_SEMWLC2_Pos      (18U)
#define FMC_CIDCFGR2_SEMWLC2_Msk      (0x1UL << FMC_CIDCFGR2_SEMWLC2_Pos)     /*!< 0x00040000 */
#define FMC_CIDCFGR2_SEMWLC2          FMC_CIDCFGR2_SEMWLC2_Msk               /*!< white-listed CID in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR2_SEMWLC3_Pos      (19U)
#define FMC_CIDCFGR2_SEMWLC3_Msk      (0x1UL << FMC_CIDCFGR2_SEMWLC3_Pos)     /*!< 0x00080000 */
#define FMC_CIDCFGR2_SEMWLC3          FMC_CIDCFGR2_SEMWLC3_Msk               /*!< white-listed CID in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR2_SEMWLC4_Pos      (20U)
#define FMC_CIDCFGR2_SEMWLC4_Msk      (0x1UL << FMC_CIDCFGR2_SEMWLC4_Pos)     /*!< 0x00100000 */
#define FMC_CIDCFGR2_SEMWLC4          FMC_CIDCFGR2_SEMWLC4_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR2_SEMWLC5_Pos      (21U)
#define FMC_CIDCFGR2_SEMWLC5_Msk      (0x1UL << FMC_CIDCFGR2_SEMWLC5_Pos)     /*!< 0x00200000 */
#define FMC_CIDCFGR2_SEMWLC5          FMC_CIDCFGR2_SEMWLC5_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR2_SEMWLC6_Pos      (22U)
#define FMC_CIDCFGR2_SEMWLC6_Msk      (0x1UL << FMC_CIDCFGR2_SEMWLC6_Pos)     /*!< 0x00400000 */
#define FMC_CIDCFGR2_SEMWLC6          FMC_CIDCFGR2_SEMWLC6_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR2_SEMWLC7_Pos      (23U)
#define FMC_CIDCFGR2_SEMWLC7_Msk      (0x1UL << FMC_CIDCFGR2_SEMWLC7_Pos)     /*!< 0x00800000 */
#define FMC_CIDCFGR2_SEMWLC7          FMC_CIDCFGR2_SEMWLC7_Msk               /*!< White-listed CID0 in the CID allocation pool of resource x in semaphore mode */

/******************  Bit definition for FMC_SEMCR2 register  ******************/
#define FMC_SEMCR2_SEM_MUTEX_Pos      (0U)
#define FMC_SEMCR2_SEM_MUTEX_Msk      (0x1UL << FMC_SEMCR2_SEM_MUTEX_Pos)     /*!< 0x00000001 */
#define FMC_SEMCR2_SEM_MUTEX          FMC_SEMCR2_SEM_MUTEX_Msk               /*!< Mutex for the CID allocation of Resource x in semaphore mode */
#define FMC_SEMCR2_SEMCID_Pos         (4U)
#define FMC_SEMCR2_SEMCID_Msk         (0x7UL << FMC_SEMCR2_SEMCID_Pos)        /*!< 0x00000070 */
#define FMC_SEMCR2_SEMCID             FMC_SEMCR2_SEMCID_Msk                  /*!< Current CID allocated to resource x in semaphore mode */

/*****************  Bit definition for FMC_CIDCFGR3 register  *****************/
#define FMC_CIDCFGR3_CFEN_Pos         (0U)
#define FMC_CIDCFGR3_CFEN_Msk         (0x1UL << FMC_CIDCFGR3_CFEN_Pos)        /*!< 0x00000001 */
#define FMC_CIDCFGR3_CFEN             FMC_CIDCFGR3_CFEN_Msk                  /*!< CID filtering enable for resource x */
#define FMC_CIDCFGR3_SEMEN_Pos        (1U)
#define FMC_CIDCFGR3_SEMEN_Msk        (0x1UL << FMC_CIDCFGR3_SEMEN_Pos)       /*!< 0x00000002 */
#define FMC_CIDCFGR3_SEMEN            FMC_CIDCFGR3_SEMEN_Msk                 /*!< Semaphore enable for resource x */
#define FMC_CIDCFGR3_SCID_Pos         (4U)
#define FMC_CIDCFGR3_SCID_Msk         (0x7UL << FMC_CIDCFGR3_SCID_Pos)        /*!< 0x00000070 */
#define FMC_CIDCFGR3_SCID             FMC_CIDCFGR3_SCID_Msk                  /*!< Static CID for resource x */
#define FMC_CIDCFGR3_SEMWLC0_Pos      (16U)
#define FMC_CIDCFGR3_SEMWLC0_Msk      (0x1UL << FMC_CIDCFGR3_SEMWLC0_Pos)     /*!< 0x00010000 */
#define FMC_CIDCFGR3_SEMWLC0          FMC_CIDCFGR3_SEMWLC0_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR3_SEMWLC1_Pos      (17U)
#define FMC_CIDCFGR3_SEMWLC1_Msk      (0x1UL << FMC_CIDCFGR3_SEMWLC1_Pos)     /*!< 0x00020000 */
#define FMC_CIDCFGR3_SEMWLC1          FMC_CIDCFGR3_SEMWLC1_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR3_SEMWLC2_Pos      (18U)
#define FMC_CIDCFGR3_SEMWLC2_Msk      (0x1UL << FMC_CIDCFGR3_SEMWLC2_Pos)     /*!< 0x00040000 */
#define FMC_CIDCFGR3_SEMWLC2          FMC_CIDCFGR3_SEMWLC2_Msk               /*!< white-listed CID in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR3_SEMWLC3_Pos      (19U)
#define FMC_CIDCFGR3_SEMWLC3_Msk      (0x1UL << FMC_CIDCFGR3_SEMWLC3_Pos)     /*!< 0x00080000 */
#define FMC_CIDCFGR3_SEMWLC3          FMC_CIDCFGR3_SEMWLC3_Msk               /*!< white-listed CID in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR3_SEMWLC4_Pos      (20U)
#define FMC_CIDCFGR3_SEMWLC4_Msk      (0x1UL << FMC_CIDCFGR3_SEMWLC4_Pos)     /*!< 0x00100000 */
#define FMC_CIDCFGR3_SEMWLC4          FMC_CIDCFGR3_SEMWLC4_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR3_SEMWLC5_Pos      (21U)
#define FMC_CIDCFGR3_SEMWLC5_Msk      (0x1UL << FMC_CIDCFGR3_SEMWLC5_Pos)     /*!< 0x00200000 */
#define FMC_CIDCFGR3_SEMWLC5          FMC_CIDCFGR3_SEMWLC5_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR3_SEMWLC6_Pos      (22U)
#define FMC_CIDCFGR3_SEMWLC6_Msk      (0x1UL << FMC_CIDCFGR3_SEMWLC6_Pos)     /*!< 0x00400000 */
#define FMC_CIDCFGR3_SEMWLC6          FMC_CIDCFGR3_SEMWLC6_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR3_SEMWLC7_Pos      (23U)
#define FMC_CIDCFGR3_SEMWLC7_Msk      (0x1UL << FMC_CIDCFGR3_SEMWLC7_Pos)     /*!< 0x00800000 */
#define FMC_CIDCFGR3_SEMWLC7          FMC_CIDCFGR3_SEMWLC7_Msk               /*!< White-listed CID0 in the CID allocation pool of resource x in semaphore mode */

/******************  Bit definition for FMC_SEMCR3 register  ******************/
#define FMC_SEMCR3_SEM_MUTEX_Pos      (0U)
#define FMC_SEMCR3_SEM_MUTEX_Msk      (0x1UL << FMC_SEMCR3_SEM_MUTEX_Pos)     /*!< 0x00000001 */
#define FMC_SEMCR3_SEM_MUTEX          FMC_SEMCR3_SEM_MUTEX_Msk               /*!< Mutex for the CID allocation of Resource x in semaphore mode */
#define FMC_SEMCR3_SEMCID_Pos         (4U)
#define FMC_SEMCR3_SEMCID_Msk         (0x7UL << FMC_SEMCR3_SEMCID_Pos)        /*!< 0x00000070 */
#define FMC_SEMCR3_SEMCID             FMC_SEMCR3_SEMCID_Msk                  /*!< Current CID allocated to resource x in semaphore mode */

/*****************  Bit definition for FMC_CIDCFGR4 register  *****************/
#define FMC_CIDCFGR4_CFEN_Pos         (0U)
#define FMC_CIDCFGR4_CFEN_Msk         (0x1UL << FMC_CIDCFGR4_CFEN_Pos)        /*!< 0x00000001 */
#define FMC_CIDCFGR4_CFEN             FMC_CIDCFGR4_CFEN_Msk                  /*!< CID filtering enable for resource x */
#define FMC_CIDCFGR4_SEMEN_Pos        (1U)
#define FMC_CIDCFGR4_SEMEN_Msk        (0x1UL << FMC_CIDCFGR4_SEMEN_Pos)       /*!< 0x00000002 */
#define FMC_CIDCFGR4_SEMEN            FMC_CIDCFGR4_SEMEN_Msk                 /*!< Semaphore enable for resource x */
#define FMC_CIDCFGR4_SCID_Pos         (4U)
#define FMC_CIDCFGR4_SCID_Msk         (0x7UL << FMC_CIDCFGR4_SCID_Pos)        /*!< 0x00000070 */
#define FMC_CIDCFGR4_SCID             FMC_CIDCFGR4_SCID_Msk                  /*!< Static CID for resource x */
#define FMC_CIDCFGR4_SEMWLC0_Pos      (16U)
#define FMC_CIDCFGR4_SEMWLC0_Msk      (0x1UL << FMC_CIDCFGR4_SEMWLC0_Pos)     /*!< 0x00010000 */
#define FMC_CIDCFGR4_SEMWLC0          FMC_CIDCFGR4_SEMWLC0_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR4_SEMWLC1_Pos      (17U)
#define FMC_CIDCFGR4_SEMWLC1_Msk      (0x1UL << FMC_CIDCFGR4_SEMWLC1_Pos)     /*!< 0x00020000 */
#define FMC_CIDCFGR4_SEMWLC1          FMC_CIDCFGR4_SEMWLC1_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR4_SEMWLC2_Pos      (18U)
#define FMC_CIDCFGR4_SEMWLC2_Msk      (0x1UL << FMC_CIDCFGR4_SEMWLC2_Pos)     /*!< 0x00040000 */
#define FMC_CIDCFGR4_SEMWLC2          FMC_CIDCFGR4_SEMWLC2_Msk               /*!< white-listed CID in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR4_SEMWLC3_Pos      (19U)
#define FMC_CIDCFGR4_SEMWLC3_Msk      (0x1UL << FMC_CIDCFGR4_SEMWLC3_Pos)     /*!< 0x00080000 */
#define FMC_CIDCFGR4_SEMWLC3          FMC_CIDCFGR4_SEMWLC3_Msk               /*!< white-listed CID in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR4_SEMWLC4_Pos      (20U)
#define FMC_CIDCFGR4_SEMWLC4_Msk      (0x1UL << FMC_CIDCFGR4_SEMWLC4_Pos)     /*!< 0x00100000 */
#define FMC_CIDCFGR4_SEMWLC4          FMC_CIDCFGR4_SEMWLC4_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR4_SEMWLC5_Pos      (21U)
#define FMC_CIDCFGR4_SEMWLC5_Msk      (0x1UL << FMC_CIDCFGR4_SEMWLC5_Pos)     /*!< 0x00200000 */
#define FMC_CIDCFGR4_SEMWLC5          FMC_CIDCFGR4_SEMWLC5_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR4_SEMWLC6_Pos      (22U)
#define FMC_CIDCFGR4_SEMWLC6_Msk      (0x1UL << FMC_CIDCFGR4_SEMWLC6_Pos)     /*!< 0x00400000 */
#define FMC_CIDCFGR4_SEMWLC6          FMC_CIDCFGR4_SEMWLC6_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR4_SEMWLC7_Pos      (23U)
#define FMC_CIDCFGR4_SEMWLC7_Msk      (0x1UL << FMC_CIDCFGR4_SEMWLC7_Pos)     /*!< 0x00800000 */
#define FMC_CIDCFGR4_SEMWLC7          FMC_CIDCFGR4_SEMWLC7_Msk               /*!< White-listed CID0 in the CID allocation pool of resource x in semaphore mode */

