STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231dxx_ca35.h
/******************  Bit definition for I2C_PECR register  *********************/
#define I2C_PECR_PEC_Pos             (0U)
#define I2C_PECR_PEC_Msk             (0xFFUL << I2C_PECR_PEC_Pos)               /*!< 0x000000FF */
#define I2C_PECR_PEC                 I2C_PECR_PEC_Msk                          /*!< PEC register */

/******************  Bit definition for I2C_RXDR register  *********************/
#define I2C_RXDR_RXDATA_Pos          (0U)
#define I2C_RXDR_RXDATA_Msk          (0xFFUL << I2C_RXDR_RXDATA_Pos)            /*!< 0x000000FF */
#define I2C_RXDR_RXDATA              I2C_RXDR_RXDATA_Msk                       /*!< 8-bit receive data */

/******************  Bit definition for I2C_TXDR register  *********************/
#define I2C_TXDR_TXDATA_Pos          (0U)
#define I2C_TXDR_TXDATA_Msk          (0xFFUL << I2C_TXDR_TXDATA_Pos)            /*!< 0x000000FF */
#define I2C_TXDR_TXDATA              I2C_TXDR_TXDATA_Msk                       /*!< 8-bit transmit data */

/******************  Bit definition for I2C_AUTOCR register  ********************/
#define I2C_AUTOCR_TCDMAEN_Pos              (6U)
#define I2C_AUTOCR_TCDMAEN_Msk              (0x1UL << I2C_AUTOCR_TCDMAEN_Pos)       /*!< 0x00000040 */
#define I2C_AUTOCR_TCDMAEN                  I2C_AUTOCR_TCDMAEN_Msk                  /*!< DMA request enable on Transfer Complete event */
#define I2C_AUTOCR_TCRDMAEN_Pos             (7U)
#define I2C_AUTOCR_TCRDMAEN_Msk             (0x1UL << I2C_AUTOCR_TCRDMAEN_Pos)      /*!< 0x00000080 */
#define I2C_AUTOCR_TCRDMAEN                 I2C_AUTOCR_TCRDMAEN_Msk                 /*!< DMA request enable on Transfer Complete Reload event */
#define I2C_AUTOCR_TRIGSEL_Pos              (16U)
#define I2C_AUTOCR_TRIGSEL_Msk              (0xFUL << I2C_AUTOCR_TRIGSEL_Pos)       /*!< 0x000F0000 */
#define I2C_AUTOCR_TRIGSEL                  I2C_AUTOCR_TRIGSEL_Msk                  /*!< Trigger selection */
#define I2C_AUTOCR_TRIGPOL_Pos              (20U)
#define I2C_AUTOCR_TRIGPOL_Msk              (0x1UL << I2C_AUTOCR_TRIGPOL_Pos)       /*!< 0x000100000 */
#define I2C_AUTOCR_TRIGPOL                  I2C_AUTOCR_TRIGPOL_Msk                  /*!< Trigger polarity */
#define I2C_AUTOCR_TRIGEN_Pos               (21U)
#define I2C_AUTOCR_TRIGEN_Msk               (0x1UL << I2C_AUTOCR_TRIGEN_Pos)        /*!< 0x000200000 */
#define I2C_AUTOCR_TRIGEN                   I2C_AUTOCR_TRIGEN_Msk                   /*!< Trigger enable */

/********************  Bit definition for I2C_VERR register***********************/
#define I2C_VERR_MINREV_Pos          (0U)
#define I2C_VERR_MINREV_Msk          (0xFUL << I2C_VERR_MINREV_Pos)             /*!< 0x0000000F */
#define I2C_VERR_MINREV              I2C_VERR_MINREV_Msk                       /*!< Minor Revision of the IP */
#define I2C_VERR_MAJREV_Pos          (4U)
#define I2C_VERR_MAJREV_Msk          (0xFUL << I2C_VERR_MAJREV_Pos)             /*!< 0x000000F0 */
#define I2C_VERR_MAJREV              I2C_VERR_MAJREV_Msk                       /*!< Major Revision of the IP */

/********************  Bit definition for I2C_IPIDR register**********************/
#define I2C_IPIDR_ID_Pos             (0U)
#define I2C_IPIDR_ID_Msk             (0xFFFFFFFFUL << I2C_IPIDR_ID_Pos)         /*!< 0xFFFFFFFF */
#define I2C_IPIDR_ID                 I2C_IPIDR_ID_Msk                          /*!< IP Identifier */

/********************  Bit definition for I2C_SIDR register**********************/
#define I2C_SIDR_SID_Pos             (0U)
#define I2C_SIDR_SID_Msk             (0xFFFFFFFFUL << I2C_SIDR_SID_Pos)         /*!< 0xFFFFFFFF */
#define I2C_SIDR_SID                 I2C_SIDR_SID_Msk                          /*!< Size Identifier */

/******************************************************************************/
/*                                                                            */
/*                    Inter-integrated Circuit Interface (I3C)                */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for I3C_CR register  ********************/
#define I3C_CR_DCNT_Pos              (0U)
#define I3C_CR_DCNT_Msk              (0xFFFFUL << I3C_CR_DCNT_Pos)          /*!< 0x0000FFFF */
#define I3C_CR_DCNT                  I3C_CR_DCNT_Msk                       /*!< count of data to transfer during a read or write message, in bytes (whatever I3C is acting as contr */
#define I3C_CR_RNW_Pos               (16U)
#define I3C_CR_RNW_Msk               (0x1UL << I3C_CR_RNW_Pos)              /*!< 0x00010000 */
#define I3C_CR_RNW                   I3C_CR_RNW_Msk                        /*!< read / non-write message (when I3C is acting as controller) */
#define I3C_CR_CCC_Pos               (16U)
#define I3C_CR_CCC_Msk               (0xFFUL << I3C_CR_CCC_Pos)            /*!< 0x00FF0000 */
#define I3C_CR_CCC                   I3C_CR_CCC_Msk                        /*!< 8-Bit CCC code */
#define I3C_CR_ADD_Pos               (17U)
#define I3C_CR_ADD_Msk               (0x7FUL << I3C_CR_ADD_Pos)             /*!< 0x00FE0000 */
#define I3C_CR_ADD                   I3C_CR_ADD_Msk                        /*!< 7-bit I3C dynamic / I2C static target address (when I3C is acting as controller) */
#define I3C_CR_MTYPE_Pos             (27U)
#define I3C_CR_MTYPE_Msk             (0xFUL << I3C_CR_MTYPE_Pos)            /*!< 0x78000000 */
#define I3C_CR_MTYPE                 I3C_CR_MTYPE_Msk                      /*!< message type (whatever I3C is acting as controller/target) */
#define I3C_CR_MTYPE_0               (0x1UL << I3C_CR_MTYPE_Pos)           /*!< 0x08000000 */
#define I3C_CR_MTYPE_1               (0x2UL << I3C_CR_MTYPE_Pos)           /*!< 0x10000000 */
#define I3C_CR_MTYPE_2               (0x4UL << I3C_CR_MTYPE_Pos)           /*!< 0x20000000 */
#define I3C_CR_MTYPE_3               (0x8UL << I3C_CR_MTYPE_Pos)           /*!< 0x40000000 */
#define I3C_CR_MEND_Pos              (31U)
#define I3C_CR_MEND_Msk              (0x1UL << I3C_CR_MEND_Pos)             /*!< 0x80000000 */
#define I3C_CR_MEND                  I3C_CR_MEND_Msk                       /*!< message end type (when the I3C is acting as controller) */

/*******************  Bit definition for I3C_CFGR register  *******************/
#define I3C_CFGR_EN_Pos              (0U)
#define I3C_CFGR_EN_Msk              (0x1UL << I3C_CFGR_EN_Pos)             /*!< 0x00000001 */
#define I3C_CFGR_EN                  I3C_CFGR_EN_Msk                       /*!< I3C enable (whatever I3C is acting as controller/target) */
#define I3C_CFGR_CRINIT_Pos          (1U)
#define I3C_CFGR_CRINIT_Msk          (0x1UL << I3C_CFGR_CRINIT_Pos)         /*!< 0x00000002 */
#define I3C_CFGR_CRINIT              I3C_CFGR_CRINIT_Msk                   /*!< initial controller/target role */
#define I3C_CFGR_NOARBH_Pos          (2U)
#define I3C_CFGR_NOARBH_Msk          (0x1UL << I3C_CFGR_NOARBH_Pos)         /*!< 0x00000004 */
#define I3C_CFGR_NOARBH              I3C_CFGR_NOARBH_Msk                   /*!< no arbitrable header after a START (when I3C is acting as a controller) */
#define I3C_CFGR_RSTPTRN_Pos         (3U)
#define I3C_CFGR_RSTPTRN_Msk         (0x1UL << I3C_CFGR_RSTPTRN_Pos)        /*!< 0x00000008 */
#define I3C_CFGR_RSTPTRN             I3C_CFGR_RSTPTRN_Msk                  /*!< HDR reset pattern enable (when I3C is acting as a controller) */
#define I3C_CFGR_EXITPTRN_Pos        (4U)
#define I3C_CFGR_EXITPTRN_Msk        (0x1UL << I3C_CFGR_EXITPTRN_Pos)       /*!< 0x00000010 */
#define I3C_CFGR_EXITPTRN            I3C_CFGR_EXITPTRN_Msk                 /*!< HDR Exit Pattern enable (when I3C is acting as a controller) */
#define I3C_CFGR_HKSDAEN_Pos         (5U)
#define I3C_CFGR_HKSDAEN_Msk         (0x1UL << I3C_CFGR_HKSDAEN_Pos)        /*!< 0x00000020 */
#define I3C_CFGR_HKSDAEN             I3C_CFGR_HKSDAEN_Msk                  /*!< High-keeper enable on SDA line (when I3C is acting as a controller) */
#define I3C_CFGR_HJACK_Pos           (7U)
#define I3C_CFGR_HJACK_Msk           (0x1UL << I3C_CFGR_HJACK_Pos)          /*!< 0x00000080 */
#define I3C_CFGR_HJACK               I3C_CFGR_HJACK_Msk                    /*!< Hot Join request acknowledge (when I3C is acting as a controller) */
#define I3C_CFGR_RXDMAEN_Pos         (8U)
#define I3C_CFGR_RXDMAEN_Msk         (0x1UL << I3C_CFGR_RXDMAEN_Pos)        /*!< 0x00000100 */
#define I3C_CFGR_RXDMAEN             I3C_CFGR_RXDMAEN_Msk                  /*!< RX-FIFO DMA request enable (whatever I3C is acting as controller/target) */
#define I3C_CFGR_RXFLUSH_Pos         (9U)
#define I3C_CFGR_RXFLUSH_Msk         (0x1UL << I3C_CFGR_RXFLUSH_Pos)        /*!< 0x00000200 */
#define I3C_CFGR_RXFLUSH             I3C_CFGR_RXFLUSH_Msk                  /*!< RX-FIFO flush (whatever I3C is acting as controller/target) */
#define I3C_CFGR_RXTHRES_Pos         (10U)
#define I3C_CFGR_RXTHRES_Msk         (0x1UL << I3C_CFGR_RXTHRES_Pos)        /*!< 0x00000400 */
#define I3C_CFGR_RXTHRES             I3C_CFGR_RXTHRES_Msk                  /*!< RX-FIFO threshold (whatever I3C is acting as controller/target) */
#define I3C_CFGR_TXDMAEN_Pos         (12U)
#define I3C_CFGR_TXDMAEN_Msk         (0x1UL << I3C_CFGR_TXDMAEN_Pos)        /*!< 0x00001000 */
#define I3C_CFGR_TXDMAEN             I3C_CFGR_TXDMAEN_Msk                  /*!< TX-FIFO DMA request enable (whatever I3C is acting as controller/target) */
#define I3C_CFGR_TXFLUSH_Pos         (13U)
#define I3C_CFGR_TXFLUSH_Msk         (0x1UL << I3C_CFGR_TXFLUSH_Pos)        /*!< 0x00002000 */
#define I3C_CFGR_TXFLUSH             I3C_CFGR_TXFLUSH_Msk                  /*!< TX-FIFO flush (whatever I3C is acting as controller/target) */
#define I3C_CFGR_TXTHRES_Pos         (14U)
#define I3C_CFGR_TXTHRES_Msk         (0x1UL << I3C_CFGR_TXTHRES_Pos)        /*!< 0x00004000 */
#define I3C_CFGR_TXTHRES             I3C_CFGR_TXTHRES_Msk                  /*!< TX-FIFO threshold (whatever I3C is acting as controller/target) */
#define I3C_CFGR_SDMAEN_Pos          (16U)
#define I3C_CFGR_SDMAEN_Msk          (0x1UL << I3C_CFGR_SDMAEN_Pos)         /*!< 0x00010000 */
#define I3C_CFGR_SDMAEN              I3C_CFGR_SDMAEN_Msk                   /*!< S-FIFO DMA request enable (when I3C is acting as controller) */
#define I3C_CFGR_SFLUSH_Pos          (17U)
#define I3C_CFGR_SFLUSH_Msk          (0x1UL << I3C_CFGR_SFLUSH_Pos)         /*!< 0x00020000 */
#define I3C_CFGR_SFLUSH              I3C_CFGR_SFLUSH_Msk                   /*!< S-FIFO flush (when I3C is acting as controller) */
#define I3C_CFGR_SMODE_Pos           (18U)
#define I3C_CFGR_SMODE_Msk           (0x1UL << I3C_CFGR_SMODE_Pos)          /*!< 0x00040000 */
#define I3C_CFGR_SMODE               I3C_CFGR_SMODE_Msk                    /*!< S-FIFO enable / status receive mode (when I3C is acting as controller) */
#define I3C_CFGR_TMODE_Pos           (19U)
#define I3C_CFGR_TMODE_Msk           (0x1UL << I3C_CFGR_TMODE_Pos)          /*!< 0x00080000 */
#define I3C_CFGR_TMODE               I3C_CFGR_TMODE_Msk                    /*!< transmit mode (when I3C is acting as controller) */
#define I3C_CFGR_CDMAEN_Pos          (20U)
#define I3C_CFGR_CDMAEN_Msk          (0x1UL << I3C_CFGR_CDMAEN_Pos)         /*!< 0x00100000 */
#define I3C_CFGR_CDMAEN              I3C_CFGR_CDMAEN_Msk                   /*!< C-FIFO DMA request enable (when I3C is acting as controller) */
#define I3C_CFGR_CFLUSH_Pos          (21U)
#define I3C_CFGR_CFLUSH_Msk          (0x1UL << I3C_CFGR_CFLUSH_Pos)         /*!< 0x00200000 */
#define I3C_CFGR_CFLUSH              I3C_CFGR_CFLUSH_Msk                   /*!< C-FIFO flush (when I3C is acting as controller) */
#define I3C_CFGR_TSFSET_Pos          (30U)
#define I3C_CFGR_TSFSET_Msk          (0x1UL << I3C_CFGR_TSFSET_Pos)         /*!< 0x40000000 */
#define I3C_CFGR_TSFSET              I3C_CFGR_TSFSET_Msk                   /*!< frame transfer set (a */

/*******************  Bit definition for I3C_RDR register  ********************/
#define I3C_RDR_RDB0_Pos             (0U)
#define I3C_RDR_RDB0_Msk             (0xFFUL << I3C_RDR_RDB0_Pos)           /*!< 0x000000FF */
#define I3C_RDR_RDB0                 I3C_RDR_RDB0_Msk                      /*!< 8-bit received data on I3C bus */

