STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231dxx_ca35.h
/* Bit fields for RCC_OCRDYR register */
#define RCC_OCRDYR_HSIRDY_Pos                        (0U)
#define RCC_OCRDYR_HSIRDY_Msk                        (0x1UL << RCC_OCRDYR_HSIRDY_Pos)                       /*!< 0x00000001 */
#define RCC_OCRDYR_HSIRDY                            RCC_OCRDYR_HSIRDY_Msk                                 /*!< HSI clock ready flag */
#define RCC_OCRDYR_HSERDY_Pos                        (8U)
#define RCC_OCRDYR_HSERDY_Msk                        (0x1UL << RCC_OCRDYR_HSERDY_Pos)                       /*!< 0x00000100 */
#define RCC_OCRDYR_HSERDY                            RCC_OCRDYR_HSERDY_Msk                                 /*!< HSE clock ready flag */
#define RCC_OCRDYR_CKREST_Pos                        (25U)
#define RCC_OCRDYR_CKREST_Msk                        (0x1UL << RCC_OCRDYR_CKREST_Pos)                       /*!< 0x02000000 */
#define RCC_OCRDYR_CKREST                            RCC_OCRDYR_CKREST_Msk                                 /*!< Clock restore state machine status */

/* Bit fields for RCC_HSICFGR register */
#define RCC_HSICFGR_HSITRIM_Pos                      (8U)
#define RCC_HSICFGR_HSITRIM_Msk                      (0x7FUL << RCC_HSICFGR_HSITRIM_Pos)                    /*!< 0x00007F00 */
#define RCC_HSICFGR_HSITRIM                          RCC_HSICFGR_HSITRIM_Msk                               /*!< HSI clock trimming */
#define RCC_HSICFGR_HSICAL_Pos                       (16U)
#define RCC_HSICFGR_HSICAL_Msk                       (0x1FFUL << RCC_HSICFGR_HSICAL_Pos)                    /*!< 0x01FF0000 */
#define RCC_HSICFGR_HSICAL                           RCC_HSICFGR_HSICAL_Msk                                /*!< HSI clock calibration */

/* Bit fields for RCC_MSICFGR register */
#define RCC_MSICFGR_MSITRIM_Pos                      (8U)
#define RCC_MSICFGR_MSITRIM_Msk                      (0x1FUL << RCC_MSICFGR_MSITRIM_Pos)                    /*!< 0x00001F00 */
#define RCC_MSICFGR_MSITRIM                          RCC_MSICFGR_MSITRIM_Msk                               /*!< MSI clock trimming */
#define RCC_MSICFGR_MSICAL_Pos                       (16U)
#define RCC_MSICFGR_MSICAL_Msk                       (0xFFUL << RCC_MSICFGR_MSICAL_Pos)                     /*!< 0x00FF0000 */
#define RCC_MSICFGR_MSICAL                           RCC_MSICFGR_MSICAL_Msk                                /*!< MSI clock calibration */

/* Bit fields for RCC_RTCDIVR register */
#define RCC_RTCDIVR_RTCDIV_Pos                       (0U)
#define RCC_RTCDIVR_RTCDIV_Msk                       (0x3FUL << RCC_RTCDIVR_RTCDIV_Pos)                     /*!< 0x0000003F */
#define RCC_RTCDIVR_RTCDIV                           RCC_RTCDIVR_RTCDIV_Msk                                /*!< HSE division factor for RTC clock */

/* Bit fields for RCC_APB1DIVR register */
#define RCC_APB1DIVR_APB1DIV_Pos                     (0U)
#define RCC_APB1DIVR_APB1DIV_Msk                     (0x7UL << RCC_APB1DIVR_APB1DIV_Pos)                    /*!< 0x00000007 */
#define RCC_APB1DIVR_APB1DIV                         RCC_APB1DIVR_APB1DIV_Msk                              /*!< APB1 clock divider */
#define RCC_APB1DIVR_APB1DIVRDY_Pos                  (31U)
#define RCC_APB1DIVR_APB1DIVRDY_Msk                  (0x1UL << RCC_APB1DIVR_APB1DIVRDY_Pos)                 /*!< 0x80000000 */
#define RCC_APB1DIVR_APB1DIVRDY                      RCC_APB1DIVR_APB1DIVRDY_Msk                           /*!< APB1 clock prescaler status */

/* Bit fields for RCC_APB2DIVR register */
#define RCC_APB2DIVR_APB2DIV_Pos                     (0U)
#define RCC_APB2DIVR_APB2DIV_Msk                     (0x7UL << RCC_APB2DIVR_APB2DIV_Pos)                    /*!< 0x00000007 */
#define RCC_APB2DIVR_APB2DIV                         RCC_APB2DIVR_APB2DIV_Msk                              /*!< APB2 clock divider */
#define RCC_APB2DIVR_APB2DIVRDY_Pos                  (31U)
#define RCC_APB2DIVR_APB2DIVRDY_Msk                  (0x1UL << RCC_APB2DIVR_APB2DIVRDY_Pos)                 /*!< 0x80000000 */
#define RCC_APB2DIVR_APB2DIVRDY                      RCC_APB2DIVR_APB2DIVRDY_Msk                           /*!< APB2 clock prescaler status */

/* Bit fields for RCC_APB3DIVR register */
#define RCC_APB3DIVR_APB3DIV_Pos                     (0U)
#define RCC_APB3DIVR_APB3DIV_Msk                     (0x7UL << RCC_APB3DIVR_APB3DIV_Pos)                    /*!< 0x00000007 */
#define RCC_APB3DIVR_APB3DIV                         RCC_APB3DIVR_APB3DIV_Msk                              /*!< APB3 clock divider */
#define RCC_APB3DIVR_APB3DIVRDY_Pos                  (31U)
#define RCC_APB3DIVR_APB3DIVRDY_Msk                  (0x1UL << RCC_APB3DIVR_APB3DIVRDY_Pos)                 /*!< 0x80000000 */
#define RCC_APB3DIVR_APB3DIVRDY                      RCC_APB3DIVR_APB3DIVRDY_Msk                           /*!< APB3 clock prescaler status */

/* Bit fields for RCC_APB4DIVR register */
#define RCC_APB4DIVR_APB4DIV_Pos                     (0U)
#define RCC_APB4DIVR_APB4DIV_Msk                     (0x7UL << RCC_APB4DIVR_APB4DIV_Pos)                    /*!< 0x00000007 */
#define RCC_APB4DIVR_APB4DIV                         RCC_APB4DIVR_APB4DIV_Msk                              /*!< APB4 clock divider */
#define RCC_APB4DIVR_APB4DIVRDY_Pos                  (31U)
#define RCC_APB4DIVR_APB4DIVRDY_Msk                  (0x1UL << RCC_APB4DIVR_APB4DIVRDY_Pos)                 /*!< 0x80000000 */
#define RCC_APB4DIVR_APB4DIVRDY                      RCC_APB4DIVR_APB4DIVRDY_Msk                           /*!< APB4 clock divider status */

/* Bit fields for RCC_APBDBGDIVR register */
#define RCC_APBDBGDIVR_APBDBGDIV_Pos                 (0U)
#define RCC_APBDBGDIVR_APBDBGDIV_Msk                 (0x7UL << RCC_APBDBGDIVR_APBDBGDIV_Pos)                /*!< 0x00000007 */
#define RCC_APBDBGDIVR_APBDBGDIV                     RCC_APBDBGDIVR_APBDBGDIV_Msk                          /*!< APBDBG clock divider */
#define RCC_APBDBGDIVR_APBDBGDIVRDY_Pos              (31U)
#define RCC_APBDBGDIVR_APBDBGDIVRDY_Msk              (0x1UL << RCC_APBDBGDIVR_APBDBGDIVRDY_Pos)             /*!< 0x80000000 */
#define RCC_APBDBGDIVR_APBDBGDIVRDY                  RCC_APBDBGDIVR_APBDBGDIVRDY_Msk                       /*!< APBDBG clock divider status */

/* Bit fields for RCC_TIMG1PRER register */
#define RCC_TIMG1PRER_TIMG1PRE_Pos                   (0U)
#define RCC_TIMG1PRER_TIMG1PRE_Msk                   (0x1UL << RCC_TIMG1PRER_TIMG1PRE_Pos)                  /*!< 0x00000001 */
#define RCC_TIMG1PRER_TIMG1PRE                       RCC_TIMG1PRER_TIMG1PRE_Msk                            /*!< Clock prescaler selection for timers of group 1 */
#define RCC_TIMG1PRER_TIMG1PRERDY_Pos                (31U)
#define RCC_TIMG1PRER_TIMG1PRERDY_Msk                (0x1UL << RCC_TIMG1PRER_TIMG1PRERDY_Pos)               /*!< 0x80000000 */
#define RCC_TIMG1PRER_TIMG1PRERDY                    RCC_TIMG1PRER_TIMG1PRERDY_Msk                         /*!< Clock prescaler status for timers of group 1 */

/* Bit fields for RCC_TIMG2PRER register */
#define RCC_TIMG2PRER_TIMG2PRE_Pos                   (0U)
#define RCC_TIMG2PRER_TIMG2PRE_Msk                   (0x1UL << RCC_TIMG2PRER_TIMG2PRE_Pos)                  /*!< 0x00000001 */
#define RCC_TIMG2PRER_TIMG2PRE                       RCC_TIMG2PRER_TIMG2PRE_Msk                            /*!< Clock prescaler selection for timers of group 2 */
#define RCC_TIMG2PRER_TIMG2PRERDY_Pos                (31U)
#define RCC_TIMG2PRER_TIMG2PRERDY_Msk                (0x1UL << RCC_TIMG2PRER_TIMG2PRERDY_Pos)               /*!< 0x80000000 */
#define RCC_TIMG2PRER_TIMG2PRERDY                    RCC_TIMG2PRER_TIMG2PRERDY_Msk                         /*!< Clock prescaler status for timers of group 2 */

